{
    "offset": 0,
    "number": 10,
    "available": 1214212,
    "news": [
        {
            "id": 328,
            "title": "Stephen Rankin and Nicole Wilson found safe and well",
            "text": "We want our comments to be a lively and valuable part of our community - a place where readers can debate and engage with the most important local issues. The ability to comment on our stories is a privilege, not a right, however, and that privilege may be withdrawn if it is abused or misused. Please report any comments that break our rules.",
            "url": "https://www.the-gazette.co.uk/news/19979470.stephen-rankin-nicole-wilson-found-safe-well/?ref=rss",
            "image": "https://www.the-gazette.co.uk/resources/images/13556912/",
            "publish_date": "2022-03-09 10:36:08",
            "author": "Jacob Nicol",
            "language": "en",
            "source_country": "GB",
            "sentiment": 0.422
        },
        {
            "id": 330,
            "title": "Susie Rodgers Millinery receives boost from Theo Paphitis",
            "text": "Theo regularly invites small businesses to get in touch and picks just six to highlight on social media each week. Susie Rodgers Millinery was one of the lucky few to be tweeted about as part of the Small Business Sunday (SBS) initiative – resulting in more followers for her firm on Twitter and a surge in enquiries. She has also been profiled on the website – www.theopaphitissbs.com – that is exclusive to SBS winners. And, as an added bonus, Susie met Theo when she attended the annual SBS networking event in Birmingham, where he handed over her winner’s certificate. It is welcome support for the Barrhead woman, who operates from a space at the Embroidery Mill in Paisley’s Abbey Mill Business Centre and specialises in creating bespoke hats and fascinators. Like many small business owners, she has found the Covid pandemic to be a real challenge. Susie said: “It was a real boost to have Theo recognise my hard work and to spread the word about my business to his followers. “The past 22 months have been difficult for businesses, especially those like mine who rely on special occasions and events such as weddings and race meetings. “Sadly, when the pandemic hit in 2020 and weddings and events were cancelled, my business came to a standstill. “I was delighted to meet Theo at the SBS event in Birmingham and receive my certificate from him.” Theo said his vision is for all SBS winners to become part of “a friendly club of like-minded individuals who can share successes and learnings.” He added: “The website will also give a valuable profile to the winners chosen and I wish Susie Rodgers Millinery every success.” For more information about Susie’s business, email susierodgersmillinery@sky.com.",
            "url": "https://www.the-gazette.co.uk/news/19989170.susie-rodgers-millinery-receives-boost-theo-paphitis/?ref=rss",
            "image": "https://www.the-gazette.co.uk/resources/images/13569609/",
            "publish_date": "2022-03-12 19:44:26",
            "author": "Jacob Nicol",
            "language": "en",
            "source_country": "GB",
            "sentiment": 0.46
        },
        {
            "id": 332,
            "title": "Thorn Athletic prepare to take on St Mungo AFC",
            "text": "However, the break also allowed Stenhousemuir Community and Dumbarton Academy to take advantage by putting points on the board. Dumbarton Academy made their home advantage count with a 2-1 victory over Glasgow Harp that took them three points clear at the top of the table on 37 points. Stenhousemuir Community’s 2-2 draw with Wishaw Wycombe Wanderers took them onto 30 points. Thorn currently occupy fourth position, with 27 points from just 13 games, but Stenhousemuir Community have played 18 matches and Dumbarton Academy have played 16. Tomorrow's fixture list sees Thorn take on St Mungo AFC at the Loretto Playing Fields. Thorn manager Johnny McEwan said: \"The division is looking very tight at the top and, for a number of reasons, it doesn't look like anyone is going to run away with it. “That said, there's not much margin for error, as we've already dropped more points than we'd have hoped for – but, then again, so have our rivals. “If we could string a few results together, we would really be able to put the pressure on but we have struggled for consistency throughout the whole season. “That has been down to injuries and suspensions and lack of player availability but these are issues that seem to be affecting all teams right now. “We have a cup quarter-final to look forward to and we are still in two other cups, so it could be a busy end to the season if we can raise our performances.”",
            "url": "https://www.the-gazette.co.uk/news/19987564.thorn-athletic-prepare-take-st-mungo-afc/?ref=rss",
            "image": "https://www.the-gazette.co.uk/resources/images/13104003/",
            "publish_date": "2022-03-11 17:30:01",
            "author": "Jack Crawford",
            "language": "en",
            "source_country": "GB",
            "sentiment": -0.153
        },
        {
            "id": 334,
            "title": "Braehead: Shoppers asked to donate to Ukraine Crisis Appeal",
            "text": "Volunteers from Rotary will be stationed at three entrances and exits – at the Marks and Spencer end of the centre, the opposite entrance and exit near Primark and outside Starbucks in the upper mall on Friday, Saturday and Sunday. They will be collecting cash donations for the British Red Cross Ukraine Crisis Appeal to help refugees fleeing the war-torn country and those staying behind in Ukraine. The British Red Cross is part of the UK’s Disasters Emergency Committee, which unites 15 member charities who are experts in humanitarian aid and specialists in different areas of disaster response. Donations to the bucket collection at Braehead will be used to help Ukrainians in urgent need by providing food, first aid, clean water, shelter support, warm clothing, hygiene parcels and medicines. The money will also be used to support Ukrainian hospitals, healthcare facilities, fire fighters, and civil protection units and train people in life-saving first aid. And also help families stay in contact with each other, educate people on the risks of explosives, as well as repair vital infrastructure, homes, healthcare centres, schools and community centres READ MORE: Renfrewshire Council donates cash to those suffering in Ukraine crisis Gary Louttit, chairperson of Renfrew Rotary’s international committee said: “From the images we see on our television screens every night, the Russian invasion of Ukraine has led to a massive humanitarian crisis. “The British Red Cross Appeal is vital to getting aid to the people who need it most and as Rotarians it is our duty to live up to our motto of Service Above Self. “We are one of the world’s biggest humanitarian organisations and along with many other people up and down the country, we’re doing all we can to support the innocent victims of war in Ukraine.” Lydia Brown, Braehead’s community development manager added: “Everyone is looking for ways to help in the Ukrainian crisis and one way Braehead can play its part is by giving Renfrew Rotary and the British Red Cross access to the many thousands of people who will come to Braehead this weekend. “I hope our visitors will give as much as they can to the appeal when they see the Rotarians with their collection buckets at the entrances and exits to the centre.”",
            "url": "https://www.the-gazette.co.uk/news/19980382.braehead-shoppers-asked-donate-ukraine-crisis-appeal/?ref=rss",
            "image": "https://www.the-gazette.co.uk/resources/images/13558233/",
            "publish_date": "2022-03-09 14:53:11",
            "author": "Jacob Nicol",
            "language": "en",
            "source_country": "GB",
            "sentiment": 0.364
        },
        {
            "id": 336,
            "title": "Renfrewshire: New campaign to clamp down on speeding drivers",
            "text": "Chief Superintendent Louise Blakelock, head of road policing, said: “All too often, police officers experience first-hand the tragic consequences of excessive speed on our roads. “The dangers of speeding are well known and the consequences can be devastating, life changing and long lasting. Excessive or inappropriate speed can cause serious harm to others, especially more vulnerable road users, and it’s a risk not worth taking. “If you’re caught speeding, you will be fined, have your licence endorsed and could even lose your licence.” Research carried out ahead of the campaign launch shows that one in three motorists admit to exceeding the speed limit by 5mph in a 30mph zone at least once in the past year. Over the same timescale, almost one in 10 confessed to driving at 90mph or more on the motorway on at least one occasion. Jenny Gilruth, Minister for Transport, said: “Speeding remains a factor in a number of fatal and serious collisions every year. That’s why I welcome this campaign to tackle this serious issue and deliver a clear message to drivers. “A collision involving speed can have far-reaching consequences, not only affecting the driver but also their family, the victim’s family, emergency services and people who witness the incident. “It doesn’t matter if you’re only slightly over the speed limit. However you try and justify it, there is no excuse for speeding.” For more information, visit roadsafety.scot/topics/speed or check out the Road Safety Scotland pages on Facebook and Twitter.",
            "url": "https://www.the-gazette.co.uk/news/19980059.renfrewshire-new-campaign-clamp-speeding-drivers/?ref=rss",
            "image": "https://www.the-gazette.co.uk/resources/images/13557777/",
            "publish_date": "2022-03-09 13:12:04",
            "author": "Jacob Nicol",
            "language": "en",
            "source_country": "GB",
            "sentiment": -0.127
        },
        {
            "id": 338,
            "title": "Netflix 'secret' codes that could help you find 'hidden' TV shows and films",
            "text": "But with so much content on the streaming platform, it can often be a struggle to choose something new to watch. Sometimes we get paralysed with all our options, but one person on the internet has shared a simple tip that could save you some time when picking a film or show. How to find 'secret' shows on Netflix A Reddit user has shared a guide to secret codes that will allow you to quickly narrow down your Netflix search. All you have to do is work out what genre of show you'd like to watch. When entering the Netflix URL into the web browser, select the code from the list below and add it into the URL, for example, www.netflix.com/browse/genre/xxx which will lead you to a host of movies or TV shows only in that certain genre. The codes can lead to come very niche areas, for example, instead of browsing Action films, you can narrow it down to just comic books and superhero films (10118) or just martial arts films (8985). Or if you're only interested in watching a miniseries you can type in 4814 and for classic TV shows, you can type in 46553 to get a range to choose from. You can find the fill list on Reddit and has been upvoted more than 140 times and has over 1.3k comments.",
            "url": "https://www.the-gazette.co.uk/news/19989004.netflix-secret-codes-help-find-hidden-tv-shows-films/?ref=rss",
            "image": "https://www.the-gazette.co.uk/resources/images/13561490/",
            "publish_date": "2022-03-12 17:24:34",
            "author": "Kieran Doody",
            "language": "en",
            "source_country": "GB",
            "sentiment": 0.062
        },
        {
            "id": 340,
            "title": "Renfrewshire: Concerns raised over staff shortages in social care sector",
            "text": "However, the charity’s chief executive, Stephen McLellan, believes efforts to provide these services are now being hindered due to a reduction of available social care workers. He said: “During the last six months of 2021, we saw a 20% increase in demand here compared to the same period in the previous year. “People appear to be much more conscious of their mental health because of the pressures everybody has been under during the pandemic. “However, recruitment in social care is a huge challenge just now in terms of retaining staff. “I think people are seeing jobs elsewhere which are paying more and, clearly, how much money you will be earning is a big consideration for a lot of people.” Mr McLellan fears these recruitment challenges could be preventing those struggling with their mental health from getting the help they need. “The lack of staff is impacting nearly every part of the work we do and appears to have had a knock-on effect in some instances in preventing people from being discharged from hospital,” he said. “This means people are being kept in hospital, not necessarily because they need to be but because there isn’t support available to help resettle them back into their communities. “It’s a vicious cycle that leads to more pressure on the health service.” Mr McLellan said more needs to be done to retain existing staff and attract new workers to the sector. He added: “I understand the Scottish Government have acknowledged the pressure on social care but changes will need to come sooner rather than later.” Social Care Minister Kevin Stewart said the Scottish Government is committed to delivering a National Care Service by the end of this Parliament to ensure everyone gets the high-quality care they are entitled to. He added: “We invested £300million of new winter pressures funding in October to maximise the capacity of the NHS and social care system this winter and, in particular, to bolster the caring workforce by increasing their numbers, providing them with additional support. “As part of that, we have already made available additional funding of up to £48million to enable employers to provide an uplift to the hourly rate of pay for staff offering direct care within adult social care to a minimum £10.02 per hour.”",
            "url": "https://www.the-gazette.co.uk/news/19968152.renfrewshire-concerns-raised-staff-shortages-social-care-sector/?ref=rss",
            "image": "https://www.the-gazette.co.uk/resources/images/13540316/",
            "publish_date": "2022-03-07 01:00:00",
            "author": "Jacob Nicol",
            "language": "en",
            "source_country": "GB",
            "sentiment": -0.087
        },
        {
            "id": 342,
            "title": "Baby names 2022: Boys and Girls names set to be popular this year",
            "text": "Research from Baby Centre shows parents are set to ditch well-known monikers as less traditional names have made the top lists this year. Here are the names tipped to be big in 2022. Top baby girl names for 2022 The name at the top of the list is Hazel, a new entry to the 2021 top 100 list and one gaining popularity. Hazel is followed by Olive, another non-traditional name, and another name that was a new entry to the 2021 top 100 list. The more traditional girl name Iris made it to third spot, which regained a spot into the 2021 top 100 list and is a name that is expected to gain more popularity throughout the year. In fourth place is Nellie, meaning horn, sunray or shining light, but a name that could also be a nickname for Helen, Ellen, Petronella, Danielle, Cornelia, Eleanor, Janelle, Chanelle, Penelope or Noelia. Elizabeth, another traditional name, came in fifth, perhaps because the Queen will be celebrating her 70th year on the throne this year. Top baby girl names for 2022. (Canva) Other regal names such as Betty, Eliza, Elsbeth, and maybe even some Lillibet's may feature in the list for next year. Taking sixth place is Mirabel, meaning wondrous or of wondrous beauty and was used for both genders in the middle ages. Mirabel is also the name of the main character in Encanto, Disney's new film. Penny, meaning weaver, is the seventh most popular girls name and could be a nickname for Penelope, which means duck. Tilly, came in eighth place, and traditionally is used as the nickname for Matilda. Tilly means battle strength. Tilly Ramsay also appeared in last years Strictly Come Dancing. Ninth place for girls names is Nova, meaning new in Latin. Billie is the tenth most popular girls name, possibly referring to Billie Eilish, who is booked to headline Glastonberry and Coachella festivals in 2022. Top baby boy names for 2022 Top baby boy names for 2022. (Canva) The top of the boy's name list is Albie, another name that is predicted to gain even more popularity throughout the year. Reggie, another non-traditional name has taken second place and is another name expected to gain popularity throughout the year. In third place is unisex name Frankie, which many people is predicted to stay at the top. Edwin, a rich and happy name meaning friend is in fourth place, and Marcus takes fifth place. The name Marcus gaining popularity could be due to Marcus Rashford, the Manchester United football player who brought positive social changes for school children. Football related names are gaining momentum, with Connor in sixth place and Aaron in seventh place of popular baby names. These could refer to Chelsea midfielder, Conor Gallagher and Arsenal goalkeeper, Aaron Ramsdale. Oakley, a nature-based name, meaning oak field, wood and clearly, scored eighth place. Felix, meaning happy or lucky, came in ninth place. Felix is also a name featured in the Bible, who was the Roman governor of Judea. The popular Welsh name, Evan, meaning the Lord is gracious, took the final place in the top ten names. Dear Evan Hansen is also a musical that soared in popularity after the film release in 2021.",
            "url": "https://www.the-gazette.co.uk/news/19988965.baby-names-2022-boys-girls-names-set-popular-year/?ref=rss",
            "image": "https://www.the-gazette.co.uk/resources/images/13398575/",
            "publish_date": "2022-03-12 16:53:24",
            "author": "Kieran Doody",
            "language": "en",
            "source_country": "GB",
            "sentiment": 0.459
        },
        {
            "id": 344,
            "title": "Paisley Roadworks: M8 repairs in place for 14 weeks",
            "text": "The refurbishment works are being undertaken on three bridges between Junctions 25 and 25A between Cardonald and Braehead Shopping Centre of the westbound M8 motorway and include bridge deck waterproofing, concrete repairs, parapet upgrades, drainage improvements and resurfacing works. It was also confirmed by Amey that the works will cost £2,000,000 overall. The traffic management for this scheme involves the works being undertaken in four phases. Phase 0 is required to improve crossovers prior to the works commencing. Contraflow will be in operation throughout all phases 1-3, which will involve a single lane crossover from the westbound outside lane to the eastbound outside lane. The entry crossover is in proximity to the M8 Junction 25 westbound off-slip, while the exit crossover is in proximity to M8 Junction 26 westbound on-slip at Hillington. Overnight total closures in the westbound direction will required between each phase of the works to allow for re-positioning of traffic management. It is envisaged that these overnight total closures will span over a maximum of two nights, with lanes in operation in the daytime. To accommodate all works phasing on the westbound carriageway, the eastbound direction shall have a single outside lane closure in place between Junctions 26 (Hillington) and 25 (Cardonald). Phase 0 will initially require an eastbound overnight total closure to facilitate the deployment of traffic management. Real time information can be found at traffiscotland.org",
            "url": "https://www.the-gazette.co.uk/news/19988725.paisley-roadworks-m8-repairs-place-14-weeks/?ref=rss",
            "image": "https://www.the-gazette.co.uk/resources/images/13568842/",
            "publish_date": "2022-03-12 12:50:58",
            "author": "Darren Gibson",
            "language": "en",
            "source_country": "GB",
            "sentiment": -0.207
        },
        {
            "id": 346,
            "title": "Proposals for new apartments in Paisley town centre unveiled",
            "text": "Kelvin Properties, an award-winning developer renowned for regenerating urban brownfield sites into thriving residential communities, hopes its plans will provide a much-needed boost to Paisley town centre, which was hit hard by the Covid-19 pandemic. The site, which has been vacant since 2018, lies south-east of Paisley town centre, on the corner of Sauce Street and Lonend. Kelvin Properties aims to redevelop the site – purchased in September last year – and provide high-quality environmentally friendly residential apartments that will provide new accommodation for members of the local community and attract others to move to the area. Marc Taylor, director of Kelvin Properties, said: “We hope to reinvigorate a derelict vacant site, and in doing so help to reinvigorate Paisley. “The location is fantastic from a sustainable travel perspective. We see this as a key gateway site to Paisley town centre, for those travelling from the south along Lonend. We have sought to design and create a high-quality development that welcomes people to the heart of the town, while removing vacant buildings which can be an eyesore. “With the development’s proximity to the town centre, as well as its accessible prices and impressive environmentally friendly features, we expect it to be extremely attractive to first time buyers and young professionals. “We truly believe this development can help Paisley thrive. We are now very excited to progress our plans with Renfrewshire Council and bring our concept to life.” Green travel will be encouraged, with a bus stop directly in front of the site and two train stations within a 10-minute walk offering direct trains to Glasgow city centre. There will also be 15 active EV charging stations within the site which help encourage the use of electric cars. The urban regeneration specialist plans to re-use as much of the crushed material from the demolition as possible to accommodate the three flatted blocks, while solar PV panels will be used on the roof to power the three apartment blocks and further reduce carbon emissions. Twenty-five one-bedroom apartments in the development have been designed to include a standalone home working area out with the bedroom – a feature Kelvin Properties believes will future-proof the development in the wake of the pandemic. The plans, which include a fully equipped children’s play area, were submitted to Renfrewshire Council last week. If successful in gaining planning, Kelvin Properties hopes to commence works on-site later this year. To view the application, visit the Renfrewshire Council website. Kelvin Properties announced last week that its development at Waverley Park in Shawlands, Glasgow had sold out in less than four months. To find out more about Kelvin Properties, visit kelvinproperties.com.",
            "url": "https://www.the-gazette.co.uk/news/19984381.proposals-new-apartments-paisley-town-centre-unveiled/?ref=rss",
            "image": "https://www.the-gazette.co.uk/resources/images/13563240/",
            "publish_date": "2022-03-10 17:33:32",
            "author": "Jacob Nicol",
            "language": "en",
            "source_country": "GB",
            "sentiment": 0.008
        }
    ]
}